#include "dht11.h"

/**********************************
*函数名：DHT11_start
*函数功能：DHT11开始信号
*输入：无
*输出：无
***********************************/
void DHT11_start()
{
   Data = 1;
   DelayUs(2);
   Data = 0;
   DelayMs(30);  //主机把总线拉低必须大于18毫秒,保证DHT11能检测到起始信号 
   Data = 1;
	 DelayUs(15);	//15*2+5=35us主机发送开始信号结束后,延时等待20-40us后，读取DHT11的响应信号
}

/*******************************************
*函数名：DHT11_rec_byte
*函数功能：接收8位二进制
*输入：无
*输出：dat
**********************************************/
uchar DHT11_rec_byte()      
{
   uchar i,dat=0;
   for(i=0;i<8;i++)    
   {          
      while(!Data);   //每一bit数据都以50us低电平时隙开始,等待拉高
		  DelayUs(20);    //0-高电平持续26~28us；1-高电平持续116~118us,
//此处延时时间过长会死循环，过短读出的数据不正确
//(仿真中偏大255，根据仿真情况调整时长；实物中会出现不随环境变化或部分变化的情况)
      dat <<= 1;        //位读取先高后低   
      if(Data == 1)    
         dat += 1;
      while(Data);     
    } 
    return dat;
}
/**********************************************
*函数名：DHT11_receive
*函数功能：接收40位的数据
*输入：无
*输出：结构体dht11_t，含温度湿度整数和小数部分
**********************************************/
dht11_t DHT11_receive(void)     
{
    uchar R_H,R_L,T_H,T_L,revise;
		dht11_t dht11;	
    DHT11_start();

    if(Data == 0)
    {
        while(Data == 0); 				//等待DHT11拉高
				DelayUs(38);   				//等待80us DHT11发送数据    
        R_H=DHT11_rec_byte();    	//接收湿度高八位    
        R_L=DHT11_rec_byte();    	//接收湿度低八位    
        T_H=DHT11_rec_byte();    	//接收温度高八位   
        T_L=DHT11_rec_byte();    	//接收温度低八位   
        revise=DHT11_rec_byte(); 	//接收校正位 	        
				if(revise == (R_H+R_L+T_H+T_L))
				{				
				//温度整数部分
					dht11.temp_i = T_H;							        
					//温度小数部分
					dht11.temp_d = T_L;				
					//湿度整数部分
					dht11.humi_i = R_H;
					//湿度小数部分
					dht11.humi_d = R_L;
				}
				DelayUs(23); //拉低总线50us，随后总线由上拉电阻进入空闲状态 
    }	 
		return dht11;
}
///////////////////////////////////////////////////