#ifndef __LCD1602_H__
#define __LCD1602_H__
/************************************************************************/
#include<reg51.h> 
#include<intrins.h>

sbit RS = P2^4;   //定义端口 
sbit RW = P2^5;
sbit EN = P2^6;

#define DataPort    P0
/*******************************************
函数名称：LcdReset
功    能：对1602液晶模块进行复位操作
参    数：无
返回值  ：无
使用方法：初始化1
********************************************/
void LcdReset(void);

/*********************************************
功    能：清屏
参    数：无
返回值  ：无
使用方法：初始化2或必要时使用
*********************************************/
void LcdClear(void);

/*******************************************
函数名称：Disp1Char
功    能：在某个位置显示一个字符
参    数：x--列坐标0-15
          y--行坐标0-1
          data--显示的字符
返回值  ：无
********************************************/
void Disp1Char(unsigned char x,unsigned char y,unsigned char Data);

/*****************************************************************
函数名称：DispStr
功    能：从某个位置起连续显示一个字符串，一行结束，不再显示
参    数：x--列坐标
          y--行坐标
          Str--待显示的字符串指针/数组
返回值  ：无
*****************************************************************/
void DispStr(unsigned char x,unsigned char y,unsigned char *str);

/****************************************************************
函数名称：DispNchar
功    能：从某个位置起连续显示N个字符，一行结束，继续换行或从头显示
参    数：x--列坐标
          y--行坐标
          n--字符个数
          str--指向字符存放位置的指针
返回值  ：无
**************************************************************************/
void DispNChar(unsigned char x,unsigned char y, unsigned char n,unsigned char *str);


//以下为函数内部调用

/*********************************************
函数名称：PosXY
功    能：输入显示字符坐标信息
参    数：x--列坐标
          y--行坐标
返回值  ：无
**********************************************/
void PosXY(unsigned char x,unsigned char y);

/*******************************************
函数名称：LcdWriteCommand
功    能：写入命令
参    数：cmd--命令，
          chk--是否判忙的标志，1：判忙，0：不判
返回值  ：无
********************************************/
void LcdWriteCommand(unsigned char cmd,unsigned char chk);

/*******************************************
函数名称：LcdWriteData
功    能：向当前地址写入显示数据
参    数：data--显示字符数据
返回值  ：无
********************************************/
void LcdWriteData( unsigned char Data);

/*******************************************
函数名称：WaitForEnable
功    能：等待1602液晶完成内部操作或超时跳出
参    数：无
返回值  ：无
********************************************/
void WaitForEnable(void);
   
#endif
