#include "step_motor.h"
unsigned char code FFW[8]={0x01,0x03,0x02,0x06,0x04,0x0c,0x08,0x09};  //四相八拍正转编码
//0000 0001 ,   0000 0011,   0000 0010, 0000 0110,.......
unsigned char code REV[8]={0x02,0x03,0x01,0x09,0x08,0x0c,0x04,0x06};  ////四相八拍反转编码
/*******************************************************
函数功能：步进电机正转
说    明：一二相励磁，每次走半个步距角,函数名中的45是以步距角90度为例的半步
********************************************************/
void  motor_ffw45X(unsigned char N)
 { 
   unsigned char i;

   for (i=0; i<N; i++)       //转45*N度
   {
       SMPort = FFW[i] ;  //取数据
       DelayMs(100);            //调节转速
   }    
 }

/********************************************************
函数功能：步进电机反转
说    明：一二相励磁，每次走半个步距角,函数名中的45是以步距角90度为例的半步
********************************************************/
void  motor_rev45X(unsigned char N)
{
     unsigned char i;
     for (i=0; i<N; i++)     //转45*N度
     {
         SMPort = REV[i];          //取数据
         DelayMs(100);            //调节转速
     }
 }